Учет_документов_20.ДокументыИТорги/src/Documents/РасшДТ_ВедомостьПередачиДокументов/РасшДТ_ВедомостьПередачиДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасшДТ_ВедомостьПередачиДокументов</name>
  <registerRecords>AccumulationRegister.РасшДТ_ОборотыПоПодаркам</registerRecords>
  <registerRecords>InformationRegister.РасшДТ_КомуОтвезлиПодарки</registerRecords>
  <registerRecords>InformationRegister.РасшДТ_ДоставкаДокументовКурьером</registerRecords>
  <attributes>
    <name>ДокументыРазвозил</name>
    <type>
      <types>CatalogRef.РасшДТ_НашиСотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Подарок1</name>
    <type>
      <types>CatalogRef.РасшДТ_ПодаркиДляКлиентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Подарок2</name>
    <type>
      <types>CatalogRef.РасшДТ_ПодаркиДляКлиентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Подарок3</name>
    <type>
      <types>CatalogRef.РасшДТ_ПодаркиДляКлиентов</types>
    </type>
  </attributes>
  <attributes>
    <name>АвторДокумента</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроверкиПодарков</name>
    <comment>Надо проверить отвозили ли этому клиенту подарок до определенной даты</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяРазвозитьПодарки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧ_СписокРазвоза</name>
    <attributes>
      <name>ПолучательДокументов</name>
      <type>
        <types>CatalogRef.РасшДТ_Клиенты</types>
      </type>
    </attributes>
    <attributes>
      <name>НомераАктов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомераУПД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомераДоговоров</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЛУРВы</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КомплектПоставки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СводныйАкт</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>АктСверки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СпециальнаяДоставка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подарок1</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Подарок2</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Подарок3</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФИОполучателя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТелПолучателя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УровеньКлиента</name>
      <type>
        <types>EnumRef.РасшДТ_УровеньКлиента</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОбеда</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Учет_документов_20.ДокументыИТорги/src/Documents/РасшДТ_ВедомостьПередачиДокументов/ManagerModule.bsl
// Процедура заполняет табличный документ для печати.
//
// Параметры:
//	ТабДок - ТабличныйДокумент - табличный документ для заполнения и печати.
//	Ссылка - Произвольный - содержит ссылку на объект, для которого вызвана команда печати.
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.РасшДТ_ВедомостьПередачиДокументов.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВедомостьПередачиДокументов.Дата,
		|	ВедомостьПередачиДокументов.ДокументыРазвозил,
		|	ВедомостьПередачиДокументов.АвторДокумента,
		|	ВедомостьПередачиДокументов.ТЧ_СписокРазвоза.(
		|		НомерСтроки,
		|		ПолучательДокументов,
		|		Наименование,
		|		Адрес,
		|		ФИОполучателя,
		|		ТелПолучателя)
		|ИЗ
		|	Документ.РасшДТ_ВедомостьПередачиДокументов КАК ВедомостьПередачиДокументов
		|ГДЕ
		|	ВедомостьПередачиДокументов.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСписокРазвозаШапка = Макет.ПолучитьОбласть("СписокРазвозаШапка");
	ОбластьСписокРазвоза = Макет.ПолучитьОбласть("СписокРазвоза");
	
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);
		
		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());	
		ТабДок.Вывести(ОбластьСписокРазвозаШапка);
		ВыборкаСписокРазвоза = Выборка.ТЧ_СписокРазвоза.Выбрать();
		Пока ВыборкаСписокРазвоза.Следующий() Цикл
			ОбластьСписокРазвоза.Параметры.Заполнить(ВыборкаСписокРазвоза);
			ТабДок.Вывести(ОбластьСписокРазвоза, ВыборкаСписокРазвоза.Уровень());
		КонецЦикла;
		
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
